{"title":"BBQ Duck on Corn Cakes","image":null,"rating":4,"level":"intermediate","servings":30,"totalTime":105,"directions":["#Corn Cakes:","Preheat the oven to 250 degrees F. Set a rack on a sheet pan in the oven. Whisk the flour, cornmeal, baking powder, sugar, paprika and salt together in a medium bowl. Set aside. Shear the corn kernels from the cob with a knife. Working over a bowl, run a knife along the cob to press out the milky liquid. Puree half the corn with the milk in a small food processor. Add the 2 tablespoons butter and the egg yolk and pulse until evenly combined. Whisk the wet ingredients into the dry. Whip the egg white in a medium bowl until it almost holds a medium-stiff peak. Lightly fold the egg white into the batter. Heat a griddle or well-seasoned cast-iron skillet over medium heat. Add 1 teaspoon of the remaining butter. Drop heaping tablespoons of the batter into the pan and cook until golden brown on the bottom and little bubbles break the surface of each pancake, about 2 to 3 minutes. Flip and cook the corn cakes on the other side until lightly brown. Serve immediately or transfer to the oven to keep warm. Repeat with the remaining batter. To assemble: Toss the duck confit in the BBQ Sauce to coat. Top each corn cake with about 1 tablespoon BBQ'd Duck Confit. Serve. Copyright 2005 Television Food Network, G.P. All rights reserved.","#KC Style BBQ Sauce:","Heat the oil in a medium saucepan over medium heat. Stir in the garlic, tomato paste, chili powder, paprika, red pepper flakes, allspice, and cloves, and cook, stirring, until paste is dark brick red, about 3 minutes. Add the ketchup, water, vinegar, molasses, sugar, salt, soy sauce, Worcestershire, mustard, black pepper, and bay leaf. Adjust the heat to maintain a gentle simmer and cook until the flavors come together, about 30 minutes. Remove from the heat and discard the garlic and bay leaf. Cool if not using immediately. Reheat before using. Yield: 1 quart sauce Recipe from Food Network Kitchens Get Grilling, Meredith Books, 2005."],"ingredients":["#Corn Cakes:","1/2 cup all-purpose flour","1/3 cup stone-ground cornmeal","3/4 teaspoon baking powder","1 teaspoon sugar","1/4 teaspoon paprika","1/2 teaspoon fine salt","1 ear corn, shucked","1/2 cup milk","2 tablespoons plus 2 teaspoons unsalted butter, melted","1 large egg, separated","2 to 3 duck confit legs, skinned and meat shredded (recommended: D'Artagnan) ","About 1 cup KC Style BBQ Sauce, recipe follows","#KC Style BBQ Sauce:","2 tablespoons neutral tasting oil, such as grapeseed or vegetable","6 cloves garlic, smashed","2 tablespoons tomato paste","1 slightly heaping tablespoon chili powder","1 tablespoon paprika","1 teaspoon crushed red pepper flakes","1/4 teaspoon ground allspic","Pinch ground cloves","2 cups ketchup","2 cups water","1/2 cup cider vinegar","1/4 cup dark molasses","1/4 cup firmly packed dark brown sugar","1 tablespoon kosher salt","1 tablespoon soy sauce","1 tablespoon Worcestershire sauce","2 teaspoons English-style dry mustard","1 teaspoon freshly ground black pepper","1 bay leaf"],"tags":["CastIronSkillet","Cake","Meat","CornRecipes","Vegetable","Tomato","Cornmeal","GrainRecipes","DuckRecipes","Poultry"],"provider":{"siteUrl":"https://www.foodnetwork.com/","recipeUrl":"https://www.foodnetwork.com/recipes/food-network-kitchen/bbq-duck-on-corn-cakes-recipe-2103370","name":"Food Network"}}