{"title":"Peanut Butter Trail Mix Cookies","tags":["American","Baking","Camping","Hiking","Road Trip","Chocolate","Peanut Butter","Trail Mix","Gluten Free","Healthy","Low Sugar","Vegan","Vegetarian","Baking Soda","Raisins","Vanilla Extract","Nuts","Seeds","Maple Syrup","Cookies","Snack","Salt","Dried Fruit","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29542/original/vegan-peanut-butter-trail-mix-cookies-recipe-chowhound.jpg","servings":18,"description":"These protein-packed peanut butter cookies are easy to make, pretty healthy (both vegan and gluten free if you want), and wholly customizable, since you can use your favorite trail mix, whether homemade or store-bought—and chock-full of dried fruit, chocolate, or both. Pack them with you everywhere: on road trips, hikes, camping trips, and weekdays at the office. They provide a boost of energy and a little sweetness to any situation, and keep for up to five days in an airtight container at room temperature, so they’re the perfect snack to stash.\nNotes: The author uses peanut butter that has been sweetened with agave, but if you use a version that is completely sugarless, you may want to add in more maple syrup, depending on how sweet you want these to be. If making these cookies gluten free, be sure to buy a brand of baking soda (like Rumford, Clabber Girl, or Bob’s Red Mill) that does not include wheat starch.","totalTime":15,"ingredients":["1 cup creamy peanut butter","1/4 cup maple syrup","1/2 teaspoon fine sea salt","1 teaspoon vanilla extract","1/2 teaspoon baking soda","1/2 cup of your favorite trail mix (with ingredients such as chocolate chips, chopped pecans, dried cherries, or pumpkin seeds)"],"directions":["Preheat the oven to 350°F. Line a baking sheet with parchment paper.","In a large bowl, stir together the peanut butter, maple syrup, salt, vanilla, and baking soda. Fold in the trail mix.","Drop the dough by rounded tablespoons onto the prepared baking sheet, spacing the mounds 2 inches apart. Gently press a fork onto the top of each cookie to slightly smash it and make a crisscross design (the dough will be sticky, so try to avoid smearing the cookie).","Bake until the edges begin to brown, about 10 minutes. Let cool completely (they will harden up as they cool). Store in an airtight container at room temperature for up to 5 days."],"nutrition":{"calories":117,"fat":8.59,"saturatedFat":1.71,"transFat":0.01,"carbs":8.03,"fiber":0.72,"sugar":4.18,"protein":3.76,"sodium":54.04}}