{"title":"Pistachio-Crusted Tofu with Red Chimichurri","tags":["Healthy","Vegan","Vegetarian","Red Wine Vinegar","Olive Oil","Oregano","Parsley","Smoked Paprika","Tofu","Pistachio","Bell Peppers","Chipotle Chile","Garlic","Onions","Scallions","Dinner","Salt","Cherry Tomatoes","Easy","Black Pepper"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29569/original/slow-roasted-pistachio-crusted-tofu-recipe-chowhound.jpg","servings":2,"description":"If you think tofu is bland, you clearly haven’t tried this dynamite vegan recipe yet. Slabs of extra-firm tofu are crusted with garlic, green onions, parsley, and pistachios and slow roasted with sweet cherry tomatoes and onion wedges, then topped off with a smoky, gently spicy red chimichurri sauce, for a healthy yet hearty dish even carnivores will love. Feel free to add more veggies to the pan for a one-pot meal, although a side of couscous or rice might be nice to soak up all the deliciousness.\nNote: Pressing the tofu is important, so don’t skip that step. This dish would be equally good with a green chimichurri sauce as well.","totalTime":60,"ingredients":["#For the tofu:","1 14-ounce package extra-firm tofu","1 cup shelled pistachios","1 tablespoon chopped green onions","1 cup loosely packed fresh flat-leaf parsley leaves, plus more chopped parsley for garnish","3 garlic cloves, peeled","1 1/2 tablespoons olive oil","1 medium red onion, cut into large wedges","1 pint cherry tomatoes, halved","fine sea salt and freshly ground black pepper","#For the chimichurri:","1 red bell pepper, seeded, deribbed, and diced","2 chipotle chiles in adobo (or more if you like it really spicy)","3 garlic cloves, peeled","1/2 cup loosely packed fresh flat-leaf parsley, chopped","1 tablespoon dried oregano","1 tablespoon smoked paprika","1/4 cup red wine vinegar","1/4 cup olive oil"],"directions":["#To make the tofu:","Preheat the oven to 300°F. Oil a 9 × 13-inch baking dish.","Wrap the tofu in a kitchen towel, place on a plate, and put a heavy pot or pan on top of the tofu (cast iron works great) for about 15 minutes. Once pressed, remove the towel and slice the tofu horizontally into 4 slabs. Place on the plate and set aside.","In a food processor, combine the pistachios, green onions, parsley, and garlic and pulse until the pistachios are the size of coarse bread crumbs. Using a pastry brush, brush 1/2 tablespoon of the olive oil onto the tofu and press the crushed pistachio mixture over the top of each piece. Place the tofu in the prepared baking dish in a single layer.","In a large bowl, toss the onion wedges and tomatoes with the remaining 1 tablespoon olive oil and season with salt and pepper. Pour the tomato-onion mixture around the tofu.","Bake until the pistachio crust starts to brown and tomatoes are just starting to burst, about 40 minutes.","#To make the chimichurri:","While the tofu is roasting, in a food processor, combine the bell pepper, chiles, garlic, parsley, oregano, and paprika and pulse until finely chopped. With the processor running, slowly pour in the vinegar and olive oil and process until it’s the consistency of a thick paste.","#To serve:","Place the crusted tofu and roasted vegetables on a serving plate, scoop the chimichurri over the crusted tofu, and season with salt and pepper. Serve immediately."]}