{"title":"Skillet Bagel Eggs with Lemon-Rosemary Butter","tags":["American","Breakfast","Camping","Vegetarian","Eggs","Butter","Lemon Juice","Rosemary","Bagel","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29555/original/skillet-bagel-eggs-recipe-chowhound.jpg","servings":2,"description":"These easy bagel eggs-in-a-nest are a perfect breakfast for camping—just fire up a skillet and melt some rosemary-lemon butter, then add cut bagels, crack an egg into the center of each half, and fry until the bread is crisp and the eggs are softly set. Toss some cherry tomatoes in the pan to blister a bit if you like. Although you might miss the wood smoke, the birdsong, and the breeze rustling the trees, this is a great breakfast to make at home too.\nNotes: You can mix the softened butter, rosemary, and lemon peel together ahead of time, then form it into a ball or disc and wrap in plastic to stash in your cooler. If your bagels don’t have holes large enough for holding the eggs, just cut or tear out a bit of the extra dough in the middle; if you’re unsure if the hole is big enough, stick the uncracked egg in the center. It should fit completely through, though it’s okay if it’s a little snug. Toss any extra dough in the skillet too and eat it on the side.\nFor another camping recipe from Shelly, get her Peanut Butter Trail Mix Cookies.","totalTime":10,"ingredients":["2 tablespoons unsalted butter","2 sprigs rosemary","peel from 1/2 lemon","1 bagel with a hole the size of an egg, split (see notes)","2 eggs","fine sea salt and freshly ground black pepper"],"directions":["Prepare a campfire for medium heat. Put a cast-iron saucepan on the grill rack or set up a tripod over the fire.","In the saucepan, combine the butter, rosemary, and lemon peel and cook until the butter melts and sizzles. Add the bagel halves, cut-sides down, and crack an egg into the center of each one. Cook until the bottom starts to brown, about 3 minutes. Check the bagel often to keep it from burning. Flip and cook until the egg has completely set, 2 to 3 minutes.","Remove from the campfire, discard the rosemary and lemon peel, and season with salt and pepper. Serve immediately."],"nutrition":{"calories":301,"fat":16.56,"saturatedFat":8.96,"transFat":0.49,"carbs":27.5,"fiber":1.58,"sugar":4.34,"protein":10.95,"cholesterol":190.49,"sodium":272.88}}