{"title":"Peach Caprese Salad","tags":["No-Cook","Salad","Fresh Mozzarella","Gluten Free","Healthy","Vegetarian","Peaches","Basil","Summer","Vinegar","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29526/original/summer-peach-mozzarella-salad-recipe-chowhound.jpg","servings":4,"description":"Multi-talented designer, TV star, and business owner Joanna Gaines can now check “write a cookbook” off her undoubtedly long to-do list. “Magnolia Table” contains recipes from the Magnolia Table restaurant as well as at-home favorites from both sides of the Gaines family, from weeknight casseroles and Tex-Mex classics to Syrian donuts and Chip’s beloved breakfasts. This take on a traditional tomato caprese salad is a deceptively simple dish that allows perfect summer peaches to shine. When they’re really ripe—super-fragrant, sweet, and juicy—just pair them with mild, milky mozzarella, aromatic fresh basil, and an easy white balsamic vinaigrette you can shake up in seconds for a fast, healthy, and gorgeous lunch, light dinner, or starter (for both casual and company’s-coming meals). The tip for making the salad dressing in a jar is likewise basic-yet-brilliant, and something you should probably start doing for all your homemade dressings.\nNote: Since there are so few ingredients here, make sure they’re all of the highest quality you can get. That means truly ripe summer peaches and soft, fresh mozzarella. If you can find locally made mozarella, that would be great, but most grocery stores have fresh mozzarella packed in water, which will work nicely. You can try burrata too, for something a little richer. It’s also worth investing in good flaky sea salt to finish the dish.","totalTime":10,"ingredients":["1/2 cup white balsamic vinegar","1/4 cup extra-virgin olive oil","2 white peaches, chilled","2 yellow peaches, chilled","2 4-ounce fresh mozzarella balls, preferably water-packed","10 fresh basil leaves, torn","1 teaspoon flaky salt","1 teaspoon freshly ground black pepper"],"directions":["In an 8-ounce screw-top jar, combine the vinegar and oil. Screw on the lid and shake well. Refrigerate until well chilled. The dressing can be made ahead and stored in the jar in the refrigerator for up to 1 week.","Remove the pits from the peaches and cut them into 1/2-inch-thick slices or wedges. Drain the mozzarella if necessary and pat it dry. Use a sharp knife to cut it into 1/4-inch-thick slices.","On a serving platter, decoratively arrange slices of the white peaches, yellow peaches, and mozzarella. Scatter the basil leaves on top, drizzle over the dressing, and sprinkle the flaky salt and pepper on top. Serve at once."],"nutrition":{"calories":379,"fat":26.58,"saturatedFat":9.36,"carbs":21.68,"fiber":2.46,"sugar":18.21,"protein":14.22,"cholesterol":44.79,"sodium":597.8}}