{"title":"Kielbasa-Cheddar Garbage Bread","tags":["Super Bowl","American","Tailgating","Cheddar","Pizza Dough","Mustard","Sauerkraut","Caraway Seed","Sesame Seeds","Kielbasa","Appetizer","Party Planning","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29547/original/kielbasa-cheddar-garbage-bread-recipe-chowhound.jpg","servings":6,"description":"Don’t let the name deter you—\"garbage bread\" is called that because you can use whatever leftovers you have on hand to fill it. In this case, you’ll roll up a Pittsburgh-inspired combo of smoky kielbasa, tangy sauerkraut, and savory cheddar cheese in pizza dough, sprinkle on sesame and caraway seeds for extra crunch and flavor, and bake it until golden-brown. Once sliced, these easy pinwheels are perfect for serving as part of a tailgating spread (especially if you’re feeding Steelers fans, though everyone else will love them too), with plenty of grainy mustard on the side for dipping. Try our New England Clam Chowder Bites recipe and our Buffalo Chicken Kolaches recipe too; make them all at once for a truly super spread.","totalTime":30,"ingredients":["1/2 pound kielbasa, coarsely chopped (about 7 ounces)","1 cup prepared sauerkraut","1/2 cup grated sharp cheddar cheese","1 (13.8 ounce) thin crust pizza dough","2 tablespoons melted butter","caraway seeds, for sprinkling","sesame seeds, for sprinkling","grainy mustard, for serving"],"directions":["Preheat oven to 375°. Line a rimmed baking sheet with parchment paper.","Roll the pizza dough out on a work surface.  You should have a 15×10 rectangle. Spread kielbasa, then a layer of half of the cheese, then the sauerkraut, and top with the rest of the cheese. Leave about an inch of dough on all edges. ","Starting on a long side, roll up the pizza dough into a long tube, and pinch the crust together to seal.","Transfer rolled dough to prepared baking sheet, seam side down. Brush with melted butter and sprinkle with caraway and sesame seeds. Bake until loaf is golden brown, about 20-22 minutes. Cool about 5 mins before slicing. Serve with grainy mustard."]}