{"title":"Seeded Apple Bread with Honey and Thyme","tags":["Scandinavian","Baking","Breakfast","Sweden","Oats","Baking Soda","Greek Yogurt","Eggs","Wheat Flour","Apples","Thyme","Flax Seed","Hazelnut","Pumpkin Seeds","Sesame Seeds","Sunflower Seeds","Honey","Snack","Bread","Fall","Winter","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29583/original/whole-wheat-apple-honey-oat-bread-recipe-chowhound.jpg","servings":12,"description":"“Lagom” is a Swedish word meaning “just the right amount” (not too little, not too much), and this dense yet tender seeded apple and oat bread from the cookbook of the same name is a perfect example of the concept. It’s just sweet enough, thanks to the apples and honey, with an extra boost of fall flavor from fresh thyme and ground hazelnuts. It’s just healthy enough to make you feel good about eating it—there’s whole wheat flour and Greek yogurt in there too—but delicious enough to taste like a treat.\nAnd while it’s great sliced and toasted for breakfast or a snack with a little butter or cream cheese (and maybe an extra drizzle of honey), it’s also balanced enough between sweet and savory that it would be fantastic alongside a bowl of butternut squash soup for lunch or dinner.","totalTime":90,"ingredients":["generous 3/4 cup oats","scant 2 1/3 cups whole wheat flour","2 teaspoons baking soda","1/2 cup flaxseeds","1/2 cup blanched hazelnuts, roughly chopped","1 teaspoon salt","1 1/2 cups Greek yogurt","1 egg, beaten","4 tablespoons best-quality honey","2 small eating apples, peeled, cored and cubed–whatever variety you like to eat on their own","2 thyme sprigs, leaves picked and roughly chopped","2–3 tablespoons mixed seeds, such as pumpkin, sunflower, flaxseeds, sesame–whatever you have to hand","butter, for greasing and to serve"],"directions":["Preheat the oven to 350ºF and grease and line a loaf pan with parchment. Mix the oats, flour, baking soda, flaxseeds, hazelnuts, and salt in a large bowl. Stir in the yogurt, egg, honey, apples, and thyme.","Pour the mixture into the prepared loaf pan and sprinkle over the mixed seeds. Bake for 1 hour 20 minutes, or until a toothpick inserted in the center comes out clean. If the loaf is browning too quickly, cover with foil and continue baking.","Remove from the oven and allow to cool completely before slicing and serving spread with butter."],"nutrition":{"calories":287,"fat":12.26,"saturatedFat":3.05,"transFat":0.06,"carbs":37.95,"fiber":7.02,"sugar":10.56,"protein":10.4,"cholesterol":21.81,"sodium":296.46}}