{"title":"Chicken and Black-Eyed Pea Chili","tags":["Healthy","Chili Powder","Cumin","Oregano","Black-Eyed Peas","Chicken","Bell Peppers","Garlic","Jalapeño Pepper","Onions","Tomatoes","Dinner","Make Ahead","Chili","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29559/original/black-eyed-pea-chicken-chili-recipe-chowhound.jpg","servings":4,"description":"A well-stocked pantry ensures you’re never too far away from a filling and delicious meal, like this easy, healthy chicken chili. Canned tomatoes and black-eyed peas are freshened up with chicken, onions, and bell peppers, plus a handful of spices, for a quick chili with one secret ingredient: a few tablespoons of brine from a jar of pickled jalapeño peppers. It doesn’t make it spicy so much as perk everything up with an acidic counterpoint. And then you can pile on as many garnishes as you like, from cheese and avocado to sour cream and scallions. If you’re up for a little extra work, try our Jalapeño Cornbread Muffins recipe on the side.\nNote: If you don’t have a jar of pickled jalapeños on hand, use 1 1/2 tablespoons distilled white vinegar in place of the brine.\nMake ahead: This chili is great on the first day, but tastes even better if you make it ahead of time and gently reheat when it’s time to serve.","totalTime":90,"ingredients":["2 tablespoons olive oil","1 1/2 pounds boneless, skinless chicken breasts and/or thighs, cut into bite-size pieces","2 teaspoons kosher salt","1 large red onion, finely diced","2 bell peppers (whatever color you like), stemmed, seeded, and finely diced","4 garlic cloves, minced","1 tablespoon ground cumin","1 tablespoon red chile powder","1 tablespoon dried oregano","1 28-oz can whole peeled tomatoes","1 (15 1/2-ounce) can black-eyed peas","3 tablespoons pickling liquid from jar of pickled jalapeño chiles, or 1 1/2 tablespoons distilled white vinegar","optional: hot sauce, sour cream, grated cheddar cheese, sliced avocado, cilantro, pickled jalapeño chiles, and sliced scallions for serving"],"directions":["In a large, heavy pot heated over medium-high heat, warm the olive oil. Add the chicken in a single layer, working in batches if necessary, and sprinkle with 1 teaspoon of the salt (divide the salt between the batches if necessary). Cook, stirring now and then, until browned all over, about 15 minutes. Add the onion, bell peppers, garlic, cumin, chile powder, and oregano and cook, stirring now and then, until the vegetables begin to soften and brown in spots, about 10 minutes. Add the tomatoes with their juice, the black-eyed peas with their liquid, and the remaining 1 teaspoon salt. Bring the mixture to a boil and then immediately lower the heat to a gentle simmer.","Cover with the lid slightly ajar to let some steam escape. Cook, stirring now and then and breaking up the tomatoes as you stir, until all of the flavors have melded and the chicken is very tender, about 1 hour. (If you’re using thighs, the meat will begin to shred.) Add the pickled jalapeño liquid, then taste the chili and add more jalapeño liquid and/or salt if needed. (If you can, let the chili cool down, then cover and refrigerate it overnight and reheat it the next day. The flavor will be even better.)","If using, set out the hot sauce, sour cream, cheddar cheese, avocado, cilantro, pickled jalapeños, and scallions. Serve the chili piping hot."],"nutrition":{"calories":606,"fat":37.03,"saturatedFat":8.99,"transFat":0.14,"carbs":33.33,"fiber":10.95,"sugar":9.59,"protein":36.78,"cholesterol":166.7,"sodium":1382.19}}