{"title":"Almond Milk Braised Pork Belly","tags":["Scandinavian","Braising","Bay Leaf","Fennel Seed","Sage","Almond Milk","Pork","Pork Belly","Garlic","Peas","Shallots","Watercress","Dinner","Fall","Winter","Comfort Food","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29587/original/milk-braised-pork-belly-recipe-chowhound.jpg","servings":4,"description":"While it may sound a bit unusual, braising pork in almond milk helps keep the meat moist and tender—and makes a delicious gravy once the dish is finished, with sage, garlic, and fennel. Gently heating the almond milk before adding it to the pork belly helps avoid splitting, although if any separation occurs, it won’t affect the taste at all. Take care not to pour the milk on the skin (so it stays crisp), and remember to brush off any excess salt before serving too.\nNote: Samphire is a crisp and salty plant that grows in or near water, but is fairly difficult to come by in most areas of the United States. While it won’t be quite the same, you can substitute thin asparagus spears for a green crunch. If you can’t find watercress, arugula can be used instead, or in conjunction with spinach to soften its bite.","totalTime":120,"ingredients":["2 3/4 pounds rolled and tied pork belly, skin scored","1 tablespoon olive oil, plus a little extra","3 cups unsweetened almond milk","1 small bunch of sage","1 teaspoon fennel seeds","2 bay leaves","pinch of red pepper flakes","1 cup fresh or frozen peas","2 shallots, sliced","1 garlic clove, finely chopped","3 1/2 ounces samphire","1 small bag of watercress (about 3 1/2 oz)"],"directions":["Preheat the oven to 475ºF. Rub the pork with the olive oil and place in a snug roasting tray. Sprinkle the skin with plenty of sea salt and roast for 25 minutes until the skin starts to blister.","Reduce the oven temperature to 350ºF and continue to cook for 1 hour.","Meanwhile, pour the almond milk into a saucepan with the sage, fennel seeds, bay leaves, and red pepper flakes and heat very gently. Once the pork has been cooking for its hour, spoon out any fat from the tray, then tip in the hot almond milk, pouring all around the meat but not on top of it. Return to the oven for a further hour–it’s ready when the meat pulls away easily.","Raise the oven temperature to its highest setting (usually 500ºF) and cook for about 10 minutes, until the pork skin has crackled all over. Remove from the tray (reserving the almondy juices) and allow to rest on a carving board, covered with foil.","Meanwhile, cook the peas in a small pan of boiling water for a few minutes (longer if using fresh peas), then drain. In a large frying pan, heat a little oil and gently fry the shallots until softened, about 5 minutes. Add the garlic and samphire and sauté, stirring frequently, until the samphire is just tender, about 4–5 minutes. Add the peas and watercress and cook until the watercress has just wilted.","Strain the almond milk into a glass measuring cup with a spout (or other vessel) to remove the herbs and spices, then pour back into the tray. Set this over a low heat and simmer until saucy. The milk may split slightly, but don’t worry too much about this as it will still taste delicious.","Brush any excess salt off the pork and carve into thick slices. Serve with the vegetables and almond milk gravy."]}