{"title":"Grilled Honey Sriracha Chicken Skewers with Blue Cheese","tags":["Super Bowl","Memorial Day","Labor Day","4th of July","American","Grilling","Tailgating","Camping","Blue Cheese","Rice Vinegar","Garlic Powder","Paprika","Parsley","Chicken","Chicken Thighs","Honey","Onions","Skewers","Dinner","Party Planning","Main Dish","Easy","Dijon Mustard","Sriracha"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29527/original/grilled-honey-sriracha-chicken-skewers-recipe-chowhound.jpg","servings":6,"description":"These easy grilled chicken skewers were inspired by buffalo wings, but are much simpler—and healthier—to make. Jake Smollett coats chunks of boneless, skinless chicken thighs in plenty of spices and brushes on a honey- and Sriracha-based sauce while the kabobs cook on the grill, then finishes them with creamy, salty, sharp blue cheese and fresh parsley for a perfect bite. These are ideal for eating all summer, from the 4th of July to Labor Day, and on into the fall (aka tailgating season).\nNote: If using wooden skewers, soak them in water for at least 20 minutes before assembling.\nIf you can’t get enough of hot sauce with blue cheese, see more buffalo chicken recipes.","totalTime":30,"ingredients":["3 tablespoons rice vinegar","2 tablespoons Sriracha","1 tablespoon honey","1 teaspoon Dijon mustard","4 boneless, skinless chicken thighs","1/2 teaspoon paprika","1/2 teaspoon granulated garlic","1/2 teaspoon granulated onion","1/2 teaspoon sea salt","1 tablespoon olive oil","1/4 cup crumbled blue cheese","handful of fresh flat-leaf parsley, chopped"],"directions":["Clean and oil the grill grates (I like to use the end of a cut onion dipped in olive oil to oil my grates) and preheat the grill to high.","In a liquid measuring cup or small bowl, whisk together the vinegar, Sriracha, honey, and mustard until smooth. Set aside.","Cut the chicken thighs into small square pieces, 6 to 8 pieces per thigh. Put the chicken in a large bowl and season it with the paprika, granulated garlic, granulated onion, and salt. Add the oil and mix to coat the chicken. Divide the chicken among the skewers.","Grill the skewers until thoroughly cooked and slightly charred, 5 to 7 minutes on each side, lightly brushing the sauce over the skewers as they cook.","Plate the skewers and top with blue cheese and parsley."],"nutrition":{"calories":211,"fat":9.26,"saturatedFat":2.79,"transFat":0.03,"carbs":3.76,"fiber":0.26,"sugar":3.03,"protein":26.73,"cholesterol":125.17,"sodium":363.18}}