{"title":"Tangy Vegan Potato Salad","tags":["Salad","Picnic","Potluck","Healthy","Vegan","Vegetarian","Sherry Vinegar","Olive Oil","Cumin","Oregano","Parsley","Smoked Paprika","Turmeric","Chickpeas","Bell Peppers","Garlic","Onions","Potatoes","Tomatoes","Side Dish","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29543/original/spicy-vegan-potato-salad-recipe-chowhound.jpg","servings":6,"description":"This recipe from Shannon Martinez and Mo Wyse of celebrated Australian restaurant Smith & Daughters was inspired by the classic Spanish dish patatas bravas, basically fried potatoes with spicy red sauce. They’ve reimagined it as a healthy, flavor- and texture-packed potato salad that happens to be vegan, making it a perfect alternative to mayo-based potato salads for summer in particular. It’s a great dish to bring to potlucks and picnics (not to mention camping), but pack it along for lunch any day of the week, or even bring it as a road trip snack for a nice change from the usual gas station fare. Hearty yet light, tangy and slightly smoky, simultaneously crunchy and creamy, it pretty much has it all.\nNotes: Ajvar is a vibrant roasted red pepper dip or relish from the Balkans that adds a lot of light, bright flavor to this salad even before you add the other ingredients. If you can’t find it, or just prefer everything from scratch, you can make your own. Use kipfler potatoes if you can find them, but any fingerlings will do in a pinch (or you can use larger waxy potatoes cut into smaller chunks).","totalTime":30,"ingredients":["#For the potato salad:","2 pounds 3 ounces fingerling potatoes, scrubbed but unpeeled (unless you really want to), cut into large chunks","1 tablespoon salt","1/2 red onion, thinly sliced into strips","2 large tomatoes, seeds removed and sliced into thin strips","1 can chickpeas, drained and rinsed","small handful flat-leaf parsley, roughly chopped","#For the dressing:","4 tablespoons ajvar (see notes)","2 tablespoons sherry vinegar","1/2 tomato, seeds removed","1 large garlic clove","1 teaspoon red pepper flakes","1/4 teaspoon ground cumin","1/2 teaspoon ground turmeric","1/2 teaspoon oregano","1 teaspoon smoked paprika","1/2 cup extra-virgin olive oil"],"directions":["Place the potatoes in a large saucepan and cover with cold water. Add the salt and bring to a boil. Reduce the heat to a simmer and cook until the potatoes can be just pierced through with a knife, about 10 minutes. Drain and transfer to a large bowl.","Blend all of the dressing ingredients except the olive oil in a blender or food processor. When mixture is smooth, with the motor running, slowly add the oil. Season with salt and pepper, to taste.","Add the red onion, tomatoes, chickpeas, and parsley to the potatoes and pour over enough dressing to coat really well. The potatoes will soak up quite a lot of the dressing, so add a little more than you think it needs. Check and adjust the seasoning, if necessary."],"nutrition":{"calories":286,"fat":20.26,"saturatedFat":2.69,"carbs":22.02,"fiber":6.06,"sugar":5.09,"protein":6.09,"sodium":416.31}}