{"title":"Freekeh Pilaf with Spiced Roasted Butternut Squash and Shallots","tags":["Middle Eastern","Healthy","Vegetarian","Grains","Allspice","Bay Leaf","Cinnamon","Thyme","Butternut Squash","Garlic","Shallots","Fall","Winter"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29580/original/spiced-butternut-squash-freekeh-recipe-chowhound.jpg","servings":4,"description":"Freekeh is an ancient Middle Eastern and Turkish staple made by harvesting immature, green durum wheat and burning away the chaff, leaving the young kernels intact while imparting a smoky flavor. That savory profile and the pleasantly chewy texture of the grain pairs beautifully with soft, sweet roasted butternut squash and shallots, and the cinnamon, allspice, and Turkish chili flakes add even more great fall flavor. This makes a comforting and filling vegetarian meal, but you can also serve it as a side with meat if you wish, like our Easy Roasted Chicken recipe.\nNote: If you can’t find freekeh, you can use another hearty grain like farro, whole wheat couscous, barley, or wheatberries (check the package to see if you need to adjust the cooking time indicated in the recipe). If using another grain, you may also want to add a pinch of smoked paprika to give it a hint of smoky flavor.","totalTime":60,"ingredients":["7 ounces freekeh","4 tablespoons olive oil","1 teaspoon allspice","1/2 teaspoon ground cinnamon","1 teaspoon Turkish red chilli flakes","2 cloves garlic, peeled but left whole","10 shallots, 2 halved and 8 left whole","1 bay leaf","2 sprigs thyme","3 to 4 cups vegetable stock","14 ounces butternut squash, peeled and cut into 1 inch cubes","2 teaspoons pomegranate molasses","1/2 teaspoon salt","1/2 teaspoon freshly ground black pepper","lemon wedges and Greek yogurt, to serve"],"directions":["Pick through the freekeh to remove any debris or grit, then rinse it thoroughly under running water and leave to drain.","Heat half the oil in a heavy-bottomed pot. Add the freekeh, allspice, cinnamon, and half the chilli flakes and stir well to coat with the oil. Add the garlic and the 2 halved shallots, together with the herbs and 3 cups of the stock. Bring to a boil, then lower the heat and simmer very gently for up to an hour. Resist the temptation to stir, as this makes the freekeh gluggy, but check every 20 minutes or so to make sure it’s not catching on the bottom of the pan. Add a little more stock if necessary.","While the freekeh is cooking, preheat the oven to 400°F.","Combine the remaining 8 shallots and the butternut squash cubes in a large mixing bowl. Add the other ingredients, including the remaining oil and chilli flakes, and toss everything together well.","Separate out the shallots and transfer them to a small roasting pan. Roast for 10 minutes, by which time they should be starting to soften and brown around the edges. Add the squash and roast for a further 10 minutes, then test to see if the squash is tender. If not, lower the heat to 350°F and roast for another 10 minutes.","When the freekeh is cooked (it will still be a little chewy at the center), check to see if all the liquid has evaporated. If not, turn up the heat for a few minutes until it is all absorbed. Remove from the heat and fish out the bay leaf and thyme if it bothers you. The shallot and garlic will have cooked down into the pilaf, so give it a good stir and taste for seasonings. Add extra salt and pepper if need be.","Gently fold in the roasted squash and shallots and serve straight away with lemon wedges and Greek yogurt on the side."],"nutrition":{"calories":461,"fat":14.66,"saturatedFat":2.08,"carbs":79.01,"fiber":13.75,"sugar":16.82,"protein":11.16,"sodium":354.85}}