{"title":"Citrus Jerk Bass with Fonio, Okra, and Tomatoes","tags":["Manhattan","Seafood","Gluten Free","Healthy","Grains","Worcestershire Sauce","Bass","Fish","Lemon Juice","Lime Juice","Orange Juice","Allspice","Ginger","Jerk Seasoning","Thai Basil","Garlic","Okra","Scallions","Shallots","Dinner","Pescatarian","Cherry Tomatoes","Scotch Bonnet Pepper","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29534/original/citrus-jerk-bass-with-fonio-recipe-chowhound.jpg","servings":6,"description":"James Beard Award nominated chef JJ Johnson (formerly of The Cecil in Harlem) highlights how the African diaspora has impacted global cuisine and shares his own personal twists, tastes, and memories in his cookbook, “Between Harlem and Heaven.” This recipe was inspired by his great-aunt’s West Indian cooking, which he didn’t appreciate as much growing up (he was more into meatloaf and spaghetti back then), but now values not just for its deliciousness, but for the way it connects him to his heritage.\nHe adds a triple hit of citrus—lemon, lime, and orange—to brighten up the rich flavors of spicy Scotch bonnet pepper, ginger, garlic, and fragrant allspice and thyme, with a little brown sugar to balance it out. Served with fonio (a highly nutritious and versatile gluten free grain from West Africa that’s similar to couscous), which is cooked with aromatics, tomatoes, and okra, this is a complete meal that you can pull off even on weeknights, although it’s best to let the fish marinate for at least two hours.\nNotes: The fonio recipe is gluten free, but you will need to make sure to buy certified gluten free brands of soy sauce and Worcestershire if you want to make the jerk fish GF as well. Lea & Perrins Worcestershire sauce is gluten free in the U.S., but not in other areas (due to the use of malt vinegar in other formulas sold elsewhere). If you can’t find bass, substitute any firm, white-fleshed fish.\nIf you’re looking for other new ways to try bass, check out our Whole Grilled Bass with Olives, Onion, and Artichoke recipe too.","totalTime":150,"ingredients":["#For the bass:","1/4 cup soy sauce","1 tablespoon Worcestershire sauce","1 teaspoon chopped fresh thyme","1 scallion, chopped","1 clove garlic, whole","1/4 Scotch bonnet pepper, chopped with seeds, or more to taste","1 teaspoon chopped fresh ginger","1/2 teaspoon ground allspice","1 teaspoon whole black peppercorns","2 tablespoons orange juice","1 tablespoon fresh lemon juice","1 teaspoon finely grated lemon zest","1 tablespoon finely grated lime zest","1/2 teaspoon kosher salt","1 teaspoon brown sugar","2 tablespoons vegetable oil","6 (4-ounce) bass fillets, skin on and descaled","#For the fonio:","2 tablespoons olive oil","1 teaspoon minced ginger","1 teaspoon minced garlic","1/4 cup small-diced shallots","1/2 cup sliced okra","1/2 cup grape tomatoes","1 cup fonio, rinsed","1/4 cup torn Thai basil"],"directions":["#To make the bass:","Combine all the ingredients for the bass except the fish in a blender and puree until smooth and completely combined.","Take the fish and lightly score the skin diagonally in four places with a sharp knife, making sure not to cut too deeply. Place the fish in a nonreactive container (glass, ceramic, or plastic) with a lid and cover with the jerk marinade. Cover and refrigerate for at least 2 hours and up to 12 hours.","Preheat the oven to 350°F and put a cast-iron grill pan in the oven to heat until it’s very hot (test by sprinkling a drop of water on the pan to see if it sizzles).","Remove the fish from the marinade and pat dry. Place in the hot pan skin side down and cook for 5 to 6 minutes. Turn the fish over and cook for 5 more minutes, until the fish flakes easily with a fork.","Remove from the pan and serve over fonio.","#To make the fonio:","In a 2-quart saucepan with a lid, heat the oil over medium heat. Sweat the ginger, garlic, and shallots and cook for 3 minutes, until the onion becomes translucent. Add the okra and tomatoes.","When the tomatoes burst, add the fonio and stir with the vegetables to coat. Add 1 1/2 cups of water, bring to a simmer, cover tightly with the lid, and turn the heat to low. Cook for about 20 minutes.","Fluff with a fork and let it steam for 5 minutes. Stir in the torn Thai basil."],"nutrition":{"calories":219,"fat":11.99,"saturatedFat":1.53,"transFat":0.04,"carbs":5.91,"fiber":1.2,"sugar":2.49,"protein":21.71,"cholesterol":90.72,"sodium":693.09}}