{"title":"Roasted Nashville Hot Chicken","tags":["Southern","Pan-Frying","Roasting","Tailgating","Picnic","Potluck","Nashville","Olive Oil","Cayenne Pepper","Chili Powder","Smoked Paprika","Chicken Thighs","Brown Sugar","Dinner","Kosher Salt","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29562/original/nashville-hot-chicken-recipe-chowhound.jpg","servings":4,"description":"Nashville hot chicken is deliciously (and seriously) spicy. This easy take from Amber Wilson retains all the lip-tingling savor of the original with a brick-red cayenne and chili powder paste, cut with a touch of dark brown sugar—but after a quick pan fry to crisp up the skin, the skillet is transferred to the oven so the meat stays perfectly juicy as it finishes cooking through. For the full experience, serve it with white bread and sweet bread-and-butter pickles to help cool your tongue and sop up all the fiery orange juices.\nFor another twist on the traditional version, try our Baked Nashville Hot Chicken recipe. In either case, follow it up with our Buttermilk-Lemon Chess Pie for an authentically southern dessert that’ll soothe the burn.\nAnd for another of Amber’s southern staples, get her Pan-Fried Trout with Pecans and Brown Butter recipe.","totalTime":50,"ingredients":["8 bone-in, skin-on chicken thighs","kosher salt","2 tablespoons sunflower oil","1/2 cup olive oil","2 tablespoons cayenne pepper","1 tablespoon dark brown sugar","1/2 teaspoon smoked sweet paprika","1/2 teaspoon chili powder"],"directions":["Preheat the oven to 425 degrees F.","Use paper towels to gently blot the chicken thighs, removing the moisture from the surface. This will ensure you get a nice crisp skin. Lightly season both sides with salt.","In a large cast iron or ovenproof skillet, heat the sunflower oil over medium heat. Once the oil is hot, gently place the chicken thighs in the pan, skin side down, and pan-fry until the skin is golden and crisp, 8 to 10 minutes. (You know it’s time to flip the thighs when the skin completely releases from the bottom of the skillet.) Flip the thighs, immediately transfer the skillet to the oven, and roast until the thighs are golden brown and the internal temperature is 165 degrees F, 25 to 30 minutes.","In a small bowl, whisk together the olive oik, cayenne, brown sugar, smoked paprika, chili powder, and 2 teaspoons salt.","While the chicken is still piping hot, brush with the pepper paste. Serve straight from the skillet."]}