{"title":"Matcha Ice Cream Sandwiches with Vegan Ginger Molasses Cookies","tags":["Los Angeles Area","American","Japanese","Dessert","Matcha","Ice Cream","Cardamom","Cinnamon","Ginger","Molasses","Cookies","Party Planning","DIY","Summer","Medium"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29538/original/green-tea-ice-cream-sandwich-recipe-chowhound.jpg","servings":12,"description":"Coolhaus is known for awesome ice cream, and this beautifully hued matcha green tea ice cream is a sophisticated treat that balances rich sweetness with a slightly smoky, earthy, and gently bitter flavor. It’s great on its own, but makes an uncommonly delicious pairing with chewy ginger molasses cookies for a grown-up take on ice cream sandwiches. You should use the freshest eggs possible for the best results, and a high-quality matcha green tea powder for the most vibrant color and best flavor.\nNote: While these cookies are vegan (when you make sure to use certified-vegan sugar that’s not processed with bone char), the ice cream is definitely not — but part of the beauty of ice cream sandwiches is the ability to mix and match as you like. So you can buy or make your own dairy-free ice cream in any flavor to put between these cookies, or if eggs and dairy aren’t a concern, replace the vegan cookies with another kind; Coolhaus recommends double-chocolate cookies as a nice alternative pairing with the matcha ice cream flavor, and we think our Chocolate-Drizzled Coconut Macaroons would be a fun choice too.\nGame Plan: Chill the ice cream base for a full 24 hours before churning for best results, in a plastic or stainless-steel pitcher with an airtight lid for easy pouring into the ice cream maker. You’ll get 1 1/2 quarts of ice cream from this recipe. The cookies can be made a few days ahead and stored in an airtight container, or if made the same day, allow at least 2 hours lead time so they cool completely. You should get 20 to 24 cookies from this recipe.\nSpecial Equipment: You will need an ice cream maker for this recipe, and it helps to have a clip-on candy thermometer as well, so you can ensure your custard stays at a safe temperature to avoid curdling your eggs.","totalTime":60,"ingredients":["#For the ice cream:","2 cups whole milk","2 cups heavy cream","1 1/4 cups granulated sugar","8 large egg yolks","2 tablespoons matcha green tea powder","#For the cookies:","1 stick (8 tablespoons) Earth Balance Natural Buttery Spread","2 cups granulated sugar (make sure the label says it’s vegan)","1/2 cup molasses","2 tablespoons flaxseeds pureed with 6 tablespoons water","1 tablespoon white vinegar","2 1/2 cups sifted bread flour (sift before measuring)","1 tablespoon baking soda","2 teaspoons ground ginger","1/2 teaspoon ground cinnamon","1/2 teaspoon ground cloves","1/2 teaspoon ground cardamom"],"directions":["#To make the ice cream:","In a 4-quart saucepan, combine milk, cream, and half of sugar. Set over high heat, and cook, stirring occasionally, until mixture comes to a boil, about 5 minutes.","Meanwhile, in a medium bowl, whisk yolks and remaining sugar until smooth, heavy, and pale yellow, about 30 seconds.","When cream mixture just comes to a boil, whisk, remove from heat, and, in a slow stream, pour half of cream mixture over yolk-sugar mixture, whisking constantly until blended.","Return pan to stovetop over low heat. Whisking constantly, stream yolk-cream mixture back into pan.","With a wooden spoon, continue stirring until mixture registers 165 to 180 degrees on an instant-read thermometer, about 2 minutes. Do not heat above 180 degrees, or eggs in base will scramble. Mixture should be slightly thickened and coat back of spoon, with steam rising, but not boiling. (If you blow on the back of the spoon and the mixture ripples, you’ve got the right consistency.)","Pour base into a clean airtight container, stir in the matcha powder, and refrigerate for 12 to 24 hours before churning in an ice cream maker per the manufacturer’s instructions.","Scrape into an airtight storage container and freeze for at least 2 hours before serving.","#To make the cookies:","In a large bowl, using a hand mixer, mix together vegan spread and sugar until just creamy, 1 to 2 minutes. Add molasses, flaxseed mixture, and white vinegar and mix to combine. Set aside.","In a medium bowl, whisk together bread flour, baking soda, ginger, cinnamon, cloves, and cardamom.","Add the dry ingredients mixture, one third at a time, to the wet ingredients, mixing with a rubber spatula or wooden spoon to combine.","Wrap bowl with plastic wrap and refrigerate for at least 20 minutes.","Preheat oven to 325 degrees, with racks in lower and upper thirds. Line two half-sheet baking pans with parchment paper.","Form dough into balls about the size of whole walnuts and place 2 inches apart on prepared baking sheets.","Bake for 8 to 10 minutes, or until edges are light brown and centers are still wet—don’t overbake.","Immediately transfer cookies to a cooling rack. Let cool for 1 hour before serving.","#To make the ice cream sandwiches:","Place 1 cookie top side down on a work surface. Scoop 1 to 2 scoops (Coolhaus uses a 4-ounce scoop) of the ice cream on top. Place another cookie top side up on top of the ice cream and press down lightly to even the filling and stick the sandwich together. Repeat to make as many as desired.","Freeze the entire sandwich. Freezing the sandwiches as whole units makes it easier to eat them, with less melty ice cream spilling out the sides. Homemade Coolhaus ice cream sandwiches are good to go after a minimum of 1 1/2 hours in the freezer and will keep for up to 2 weeks, wrapped tightly in plastic wrap."],"nutrition":{"calories":630,"fat":27.58,"saturatedFat":13.12,"carbs":89.93,"fiber":1.34,"sugar":67.92,"protein":7.74,"cholesterol":181.38,"sodium":430.09}}