{"title":"Pan-Fried Trout with Pecans and Brown Butter","tags":["American","Southern","Pan-Frying","Dinner Party","Camping","Butter","Trout","Lemon Juice","Parsley","Pecans","Dinner","Pescatarian","Main Dish","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29553/original/pan-fried-pecan-trout-recipe-chowhound.jpg","servings":4,"description":"This is Southern food maven Amber Wilson’s New Orleans-inspired take on trout amandine, in which toasty pecans replace the almonds. With brown butter, parsley, and lemon juice, they make an easy yet elegant topping for pan-fried trout. This dish is simple enough to make on a weeknight, but refined enough for company—and you could even cook it in a skillet over a campfire by the lake, preferably with fish you’ve recently caught from those same waters. Still, it’s fantastic with store-bought fillets too.\nFor another way to make this mild, sweet fish, get our Campfire Trout with Herbs and Bacon recipe.","totalTime":15,"ingredients":["4 trout fillets (4 to 6 ounces each)","kosher salt and freshly ground black pepper","1/2 cup all-purpose flour, for dredging","8 tablespoons (1 stick) unsalted butter","1/2 cup thinly sliced pecans","juice of 1 lemon, plus wedges for serving","2 tablespoons finely chopped parsley leaves"],"directions":["Season both sides of the fillets with salt and pepper. Place the flour in a shallow bowl. Dredge both sides of the fillets in the flour, shaking off the excess.","In a large cast iron or heavy-bottomed skillet, melt 4 tablespoons of the butter over medium-high heat. Just as the butter melts, add the fillets and cook on each side until golden brown, about 3 minutes per side. Transfer the fish to 4 warm serving plates.","Add the remaining 4 tablespoons butter to the skillet and reduce the heat to medium-low. Swirl the pan and cook just until the butter begins to brown. Add the sliced pecans and stir constantly until gently toasted, about 3 minutes. Take off the heat and add the lemon juice and parsley. Spoon the sauce over the fish and serve with lemon wedges."],"nutrition":{"calories":531,"fat":38.96,"saturatedFat":16.12,"transFat":0.92,"carbs":14.16,"fiber":1.82,"sugar":0.57,"protein":31.35,"cholesterol":139.57,"sodium":461.06}}