{"title":"New England Clam Chowder Bites","tags":["Super Bowl","American","New England","Tailgating","Cream Cheese","Clams","Parsley","Bacon","Garlic","Potatoes","Appetizer","Party Planning"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29546/original/new-england-clam-chowder-bites-recipe-chowhound.jpg","servings":16,"description":"Think of this uniquely delicious game day snack as crab rangoon if it came from New England. Crisp wonton wrappers contain a rich, chowder-inspired clam, bacon, potato, and cream cheese filling, with a little garlic for extra kick. You don’t have to be rooting for the Patriots to indulge in these, or even be watching football for that matter, because they’re great for any party. Plus, they’re baked, not fried, making them healthier than usual. For a couple more spirited snacks, try our Kielbasa-Cheddar Garbage Bread recipe and our Buffalo Chicken Kolaches recipe too.","totalTime":35,"ingredients":["2 slices thick bacon, diced","2 tablespoons unsalted butter","1/2 cup russet potatoes, peeled and diced","1/2 shallot, minced","1 garlic clove, minced","4 ounces cream cheese, room temperature","1 (6.5-ounce) can of clams, chopped and drained","2 tablespoons coarsely chopped fresh parsley leaves","kosher salt and freshly ground black pepper, to taste (1/4 tsp salt, 1/4 tsp pepper)","16 2-inch wonton wrappers","1 large egg, beaten","2 tablespoons vegetable oil"],"directions":["Heat a large skillet over medium-high heat. Add bacon and cook until brown and crispy, about 6-8 minutes. Drain on paper towels. Reserve bacon fat.","Add 1 tablespoon of reserved bacon fat to your pan over medium. Add potatoes and cook until potatoes begin to soften and turn golden brown, about 4-5 minutes. Add shallot and garlic, and cook, stirring frequently, until onions have become translucent, about 2-3 minutes. Remove from heat and set aside to cool, about 10 minutes.","In a large bowl, combine bacon, potato mixture, cream cheese, clams, and parsley; season with salt and pepper.","Preheat oven to 400°. ","Place wonton wrappers on a work surface. Brush the edges of the wrappers with egg wash (made of 1 beaten egg).  Spoon about 1 tbsp. mixture into the center of each wrapper.  Bring up the sides over the filling to create an “X” or diamond shape, pinching the edges to seal.","Lightly oil a rimmed baking sheet or coat with nonstick spray.","Carefully place wontons in a single layer onto the baking sheet; brush with vegetable oil/spray with nonstick spray. Bake until golden brown and crisp, rotating halfway through, 10-12 minutes. Serve immediately."],"nutrition":{"calories":187,"fat":7.98,"saturatedFat":3.08,"transFat":0.08,"carbs":20.84,"fiber":0.72,"sugar":0.46,"protein":7.37,"cholesterol":34.19,"sodium":250.37}}