{"title":"Buffalo Chicken Kolaches with Blue Cheese Dip","tags":["Dallas-Fort Worth","Super Bowl","Tailgating","Blue Cheese","Cheddar","Sharp Cheddar","Hot Sauce","Buttermilk","Sour Cream","Chives","Chicken","Honey","Celery","Appetizer","Snack","Party Planning","Dough","Easy","Black Pepper"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29545/original/buffalo-chicken-kolaches-recipe-chowhound.jpg","servings":8,"description":"Although they originated in Eastern Europe, kolaches have become a Texas tradition too; the sweet pastries sometimes go savory, as in this easy, wings-inspired game day snack that uses prepared biscuit dough as the base. It’s wrapped up around shredded chicken in buffalo hot sauce, then baked until golden and crisp, and served with a quick, homemade buttermilk blue cheese sauce for dipping. You don’t have to be from Dallas (or even a Cowboys fan) to fall for these, but if you are, it might make you love them even more. For more team-inspired snacks, get our New England Clam Chowder Bites recipe and our Kielbasa-Cheddar Garbage Bread recipe too.","totalTime":35,"ingredients":["3 tablespoons unsalted butter","1/4 cup hot pepper sauce, preferably Frank’s","1 teaspoon honey","3/4 teaspoon salt","1/2 cup shredded cooked chicken","1 tube refrigerated biscuit dough","1/2 cup shredded sharp cheddar cheese","1/2 celery stalk, minced, plus celery sticks for serving","4 tablespoons butter, melted (for brushing)","3 tablespoons chopped chives, divided","1/3 cup sour cream","3 tablespoons buttermilk","3 tablespoons crumbled blue cheese","1/4 teaspoon freshly ground black pepper"],"directions":["Preheat oven to 375°. Line a baking sheet with parchment paper.","In a small saucepan, cook 3 tablespoons butter, hot sauce, honey, and 1/2 teaspoon salt over low heat, whisking until the butter is melted and fully incorporated. Toss hot sauce mixture with shredded chicken. ","On a work surface, flatten each biscuit round to about 1/4-inch thickness. Top each round of dough with about 1 tablespoon chicken mixture, cheese, and minced celery. Pinch the edges together to create a ball.","Place the balls seam side-down on the baking sheet. Brush tops with melted butter and sprinkle with 1 tablespoon chives.","Bake until the tops of biscuits are golden and cooked through, about 20 minutes.","While kolaches bake, whisk sour cream, buttermilk, blue cheese, pepper, remaining 1 tablespoon chives, and remaining 1/4 teaspoon salt in a medium bowl. Serve kolaches with dip."],"nutrition":{"calories":255,"fat":17.68,"saturatedFat":10.37,"transFat":0.49,"carbs":15.98,"fiber":0.84,"sugar":1.68,"protein":8.2,"cholesterol":50.01,"sodium":495.87}}