{"title":"Orange, Honey, and Thyme Brined Turkey Breast","tags":["Oranges","Thyme","Turkey","Honey","Christmas","Thanksgiving","Brining","Dinner Party","Healthy","Bay Leaf","Shallots","Water","Salt","Holidays","Fall","Poultry","Main Dish","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/2013/10/30869_RecipeImage_620x413_orange_honey_brined_turkey_breast.jpg","servings":6,"rating":2.1,"description":"Brining a 15-pound turkey for a Thanksgiving crowd requires a little more finessing of fridge space than this smaller turkey breast for six people. Once you have the orange, honey, and herb brine combined and cooled, just pour it into a resealable bag, add the turkey breast, and let it hang out in a 13-by-9-inch dish in the fridge overnight. When you’re ready to cook, add extra flavor with a fresh thyme rub, and roast first on high to get a deep golden skin, then on low for the juiciest meat ever. Serve all the classic Thanksgiving dishes on the side.\nSpecial equipment: You’ll need a 2- to 2-1/2-gallon resealable food-safe bag for brining the turkey.","totalTime":180,"ingredients":["#For brining the turkey breast:","2 medium oranges","4 cups cold water, plus more as needed","3 ounces salt (1/2 rounded cup Diamond Crystal kosher salt OR 1/3 rounded cup Morton kosher salt OR 1/4 cup plus 1 tablespoon fine sea salt)","1/2 cup orange blossom honey","6 thyme sprigs","2 bay leaves","2 medium shallots, peeled and quartered","1 tablespoon freshly ground black pepper","Ice","1 whole bone-in turkey breast (6 to 7 pounds total)","#For roasting the turkey breast:","2 tablespoons olive oil","1 tablespoon finely chopped fresh thyme leaves","1 teaspoon freshly ground black pepper"],"directions":["#For brining the turkey breast:","Using a vegetable peeler, remove the zest from the oranges in wide strips, avoiding the white pith; place it in a medium saucepan. Juice the oranges and set aside 1/2 cup of the juice (save the rest for another use).","Add 1 cup of the measured water, the salt, honey, thyme, bay leaves, shallots, and pepper to the saucepan, stir to combine, and bring to a simmer over high heat. Reduce the heat to low and continue to simmer, stirring occasionally, until the salt and honey have completely dissolved, about 8 minutes. Transfer to a heatproof 2-quart container and add the remaining 3 cups of water and the reserved orange juice. Let cool for 45 minutes.","Fill a 2-cup measuring cup with ice and add enough water to measure 2 cups. Pour it into the cooled brine mixture and stir to combine.","Place a 2- to 2-1/2-gallon resealable bag in a 13-by-9-inch baking dish and open the bag. Pour in the brine and place the turkey breast in the bag, skin-side down. Seal the bag, place the dish in the refrigerator, and brine for at least 8 hours and up to 16 hours.","#For roasting the turkey breast:","Heat the oven to 425°F and arrange a rack in the middle. Combine the oil, thyme, and pepper in a small bowl; set aside.","Remove the turkey from the brine and pat it dry with paper towels; discard the brine. Place the turkey skin-side up in a roasting pan fitted with a rack. Rub the thyme mixture all over the top and sides of the turkey.","Roast for 30 minutes. Reduce the oven temperature to 325°F and continue to roast until an instant-read thermometer inserted into the center of the breast registers 160°F and the juices run clear, about 75 minutes more. (Check the turkey after 1 hour and if the skin starts to get too brown before the meat is done, loosely cover the breast with foil.)","Place the roasting pan on a wire rack and let the turkey rest at least 10 minutes before carving."],"nutrition":{"calories":213,"fat":6.69,"saturatedFat":1.21,"carbs":33.73,"fiber":2.66,"sugar":28.87,"protein":7.56,"cholesterol":18.43,"sodium":669.51}}