{"title":"Spanish Ham and Cheese Stuffed Fried Pork Chops","tags":["Pan-Frying","Manchego","Ham","Pork Chop","Weeknight Dinner","Piquillo Pepper","Easy","Panko Breadcrumbs"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29536/original/ham-and-cheese-stuffed-fried-pork-chops-recipe-chowhound.jpg","servings":4,"description":"Award-winning chef Katie Button of Asheville, N.C.‘s Cúrate tapas bar knows and loves Spanish food, but wasn’t a big fan of the cheap, rubbery cheese usually found in this classic kid-friendly dish in the country. She stuffs the pork chops with nutty Manchego (kids who can handle cheddar should have no complaints), sweet and mild piquillo peppers (which you can leave out if need be), and thinly sliced ham. The panko crust crisps up in the hot oil and the cheese melts while the meat stays tender, for a weeknight meal you and your kids will love—but you can definitely serve it to dinner guests too.\nNotes: If you prefer chicken, replace the pork chops with boneless, skinless breasts. Serve with our Spanishy Couscous Salad, and simple steamed, sauteed, or roasted vegetables, or even a green salad, on the side.","totalTime":30,"ingredients":["4 (3/4-inch-thick) boneless pork loin chops","kosher salt and freshly ground black pepper","6 deli-thin slices black forest ham","3 ounces Cordobés or Manchego cheese, shaved into pa­per-thin slices with a vegetable peeler","4 piquillo peppers, cut open","1/4 cup all-purpose flour","1 large egg","1 cup panko (Japa­nese bread crumbs)","canola oil, for frying"],"directions":["Place each pork chop between large sheets of plastic wrap and pound with a meat mal­let, heavy skillet, or rolling pin until 1/8-inch thick. Season both sides of each chop with salt and pepper. Place 1 1/2 slices ham on each chop in a single layer to cover the surface, then layer the cheese and piquillos on one half of each chop. Fold each chop in half like a book to enclose the cheese and piquillos.","Place the flour in a shallow dish, beat the egg in another, and spread the panko in a third. Carefully dredge all sides of the stuffed pork chops in the flour and shake off the excess. Then, coat in the beaten egg and dredge in the panko. Tap off any excess crumbs.","Add enough oil to a large skillet to come 1/4 inch up the sides. Heat over medium-high heat until hot. A panko crumb should sizzle immedi­ately when dropped in. Add 2 breaded chops and cook, turning once, until golden brown, about 3 minutes per side. Drain on paper towels and season lightly with salt. Repeat with the remain­ing pork chops and serve immediately."]}