{"title":"Creamy Beet Linguine with Walnuts and Feta","tags":["Pasta","Dinner Party","Feta","Healthy","Vegetarian","Linguine","Red Wine Vinegar","Dill","Thyme","Cannellini Beans","Walnuts","Beets","Garlic","Dinner","Crème Fraîche","Fall","Easy"],"image":"https://search.chow.com/thumbnail/1200/0/www.chowstatic.com/assets/models/promotions/photos/29572/original/creamy-beet-linguine-recipe-chowhound.jpg","servings":4,"description":"Give tomato sauce a break and try pureeing earthy roasted beets and garlic into a beautiful magenta sauce for pasta, with a little crème fraîche and red wine vinegar to keep it from being too sweet, and mild cannellini beans to give it extra body and nutrition. Topped off with crunchy, buttery toasted walnuts and creamy, salty, sharp feta, it’s a perfect fall pasta that’s uncommon yet easy to whip up. Since it happens to also be vegetarian, it’s great for pleasing a diverse group at dinner too.\nFor another fall favorite, try our Tangy Apple and Beet Salad recipe. And for another unusually comforting recipe from Lagom, get this Almond Milk Braised Pork Belly recipe.","totalTime":60,"ingredients":["4 medium beets, scrubbed and cut into wedges","4 garlic cloves, unpeeled","2 tablespoons olive oil","few thyme sprigs, leaves picked","2 3/4 cups canned cannellini beans, drained","1 tablespoon red wine vinegar","3 tablespoon crème fraîche","14 ounces whole wheat linguine","feta, crumbled, to serve","few dill sprigs, roughly chopped, to serve","toasted walnuts, to serve"],"directions":["Preheat the oven to 400º Fahrenheit. Place the beet wedges and garlic in a roasting tray and drizzle with the oil. Season with salt and pepper and sprinkle over the thyme leaves. Roast for 30–40 minutes, until tender and beginning to caramelize.","Remove from the oven, and trim any tough, darker bits off the beetroot. Put in a food processor or, if using a stick blender, a deep jug. Squeeze the garlic from their skins and add to the beetroot.","Tip in the cannellini beans, vinegar, crème fraîche and 7 tablespoons water and blitz until you have a smooth paste–add more water if it seems very thick.","Cook the linguine according to the package instructions and drain. Return to the still-warm pan and stir through the beet sauce. Serve topped with a little crumbled feta, some dill, and toasted walnuts for crunch."]}